dhzl84/ESP8266-Smart-Home/src/main.cpp
    DRAW_DISPLAY_MAIN();
    fetchUpdate = false;
    Serial.println("Remote update started");
    WiFiClient client;
    t_httpUpdate_return ret = ESPhttpUpdate.update(client, myConfig.updServer, FW);

    switch (ret) {
    case HTTP_UPDATE_FAILED:
      Serial.printf("HTTP_UPDATE_FAILD Error (%d): %s \n", ESPhttpUpdate.getLastError(), ESPhttpUpdate.getLastErrorString().c_str());
      break;

    case HTTP_UPDATE_NO_UPDATES:
      Serial.println("HTTP_UPDATE_NO_UPDATES");
      break;

    case HTTP_UPDATE_OK:
      Serial.println("HTTP_UPDATE_OK");
      break;
    }
  }
}

void SPIFFS_MAIN(void) {
  if (nameChanged == true) {
      if (saveConfiguration(myConfig)) {
      nameChanged = false;
      myMqttHelper.setTriggerDiscovery(true);
      } else {
      /* write failed, retry next loop */
    }
  }
  /* avoid extensive writing to SPIFFS, therefore check if the target temperature didn't change for a certain time before writing. */
  if ( (myThermostat.getNewCalib()) || (myThermostat.getTargetTemperature() != myConfig.tTemp) || (myThermostat.getThermostatHysteresis() != myConfig.tHyst) || (myThermostat.getThermostatMode() != myConfig.mode) ) {
    SPIFFS_REFERENCE_TIME = millis();  // ToDo: handle wrap around
    myConfig.tTemp  = myThermostat.getTargetTemperature();
    myConfig.calibF = myThermostat.getSensorCalibFactor();
    myConfig.calibO = myThermostat.getSensorCalibOffset();
    myConfig.tHyst  = myThermostat.getThermostatHysteresis();
    myConfig.mode   = myThermostat.getThermostatMode();
    myThermostat.resetNewCalib();
    SPIFFS_WRITTEN = false;
    #if defined CFG_DEBUG
    Serial.println("SPIFFS to be stored after debounce time: " + String(SPIFFS_WRITE_DEBOUNCE));
    #endif /* CFG_DEBUG */
  } else {
    /* no spiffs data changed this loop */
  }
  if (SPIFFS_WRITTEN == true) {
    /* do nothing, last change was already stored in SPIFFS */
  } else { /* latest change not stored in SPIFFS */
    if (SPIFFS_REFERENCE_TIME + SPIFFS_WRITE_DEBOUNCE < millis()) { /* check debounce */
      /* debounce expired -> write */
      if (saveConfiguration(myConfig)) {
        SPIFFS_WRITTEN = true;
      } else {
        /* SPIFFS not written, retry next loop */
        #if defined CFG_DEBUG
        Serial.println("SPIFFS write failed");
        #endif /* CFG_DEBUG */
      }
    } else {
      /* debounce SPIFFS write */
    }
  }
}
/*===================================================================================================================*/
/* callback, interrupt, timer, other functions */
/*===================================================================================================================*/

void ICACHE_RAM_ATTR onOffButton(void) {
  /* debouncing routine for encoder switch */
  if (TimeReached(onOffButtonDebounceTime)) {
    SetNextTimeInterval(onOffButtonDebounceTime, buttonDebounceInterval);
    myThermostat.toggleThermostatMode();
  }
}

#if CFG_PUSH_BUTTONS
void ICACHE_RAM_ATTR upButton(void) {
  /* debouncing routine for push button */
  if (TimeReached(upButtonDebounceTime)) {
    SetNextTimeInterval(upButtonDebounceTime, buttonDebounceInterval);
    myThermostat.increaseTargetTemperature(tempStep);
  }
}

void ICACHE_RAM_ATTR downButton(void) {
  /* debouncing routine for push button */
  if (TimeReached(downButtonDebounceTime)) {
    SetNextTimeInterval(downButtonDebounceTime, buttonDebounceInterval);
    myThermostat.decreaseTargetTemperature(tempStep);
  }
}
#else
void ICACHE_RAM_ATTR updateEncoder(void) {
  int16_t MSB = digitalRead(PHYS_INPUT_1_PIN);
  int16_t LSB = digitalRead(PHYS_INPUT_2_PIN);

  int16_t encoded = (MSB << 1) |LSB;  /* converting the 2 pin value to single number */

  int16_t sum  = (lastEncoded << 2) | encoded; /* adding it to the previous encoded value */

  if (sum == 0b1101 || sum == 0b0100 || sum == 0b0010 || sum == 0b1011) { /* gray patterns for rotation to right */
    rotaryEncoderDirectionInts += rotRight; /* count rotation interrupts to left and right, this shall make the encoder routine more robust against bouncing */
  }
  if (sum == 0b1110 || sum == 0b0111 || sum == 0b0001 || sum == 0b1000) { /* gray patterns for rotation to left */
    rotaryEncoderDirectionInts += rotLeft;
  }

  if (encoded == 0b11) { /* if the encoder is in an end position, evaluate the number of interrupts to left/right. simple majority wins */
    #ifdef CFG_DEBUG_ENCODER
    Serial.println("Rotary encoder interrupts: " + String(rotaryEncoderDirectionInts));
    #endif

    if (rotaryEncoderDirectionInts > rotRight) { /* if there was a higher amount of interrupts to the right, consider the encoder was turned to the right */
      myThermostat.increaseTargetTemperature(tempStep);
    } else if (rotaryEncoderDirectionInts < rotLeft) { /* if there was a higher amount of interrupts to the left, consider the encoder was turned to the left */
      myThermostat.decreaseTargetTemperature(tempStep);
    } else {
      /* do nothing here, left/right interrupts have occurred with same amount -> should never happen */
    }
    rotaryEncoderDirectionInts = rotInit; /* reset interrupt count for next sequence */
  }
  lastEncoded = encoded; /* store this value for next time */
}
#endif /* CFG_PUSH_BUTTONS */

/* Home Assistant discovery on connect; used to define entities in HA to communicate with*/
void homeAssistantDiscovery(void) {
  #if CFG_MQTT_LIB == cArduinoMQTT
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoveryClimate(),                   myMqttHelper.buildHassDiscoveryClimate(String(myConfig.name), String(FW)),         true, MQTT_QOS);    // make HA discover the climate component
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoveryBinarySensor(bsSensFail),    myMqttHelper.buildHassDiscoveryBinarySensor(String(myConfig.name), bsSensFail),    true, MQTT_QOS);    // make HA discover the binary_sensor for sensor failure
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoveryBinarySensor(bsState),       myMqttHelper.buildHassDiscoveryBinarySensor(String(myConfig.name), bsState),       true, MQTT_QOS);    // make HA discover the binary_sensor for thermostat state
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sTemp),               myMqttHelper.buildHassDiscoverySensor(String(myConfig.name), sTemp),               true, MQTT_QOS);    // make HA discover the temperature sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sHum),                myMqttHelper.buildHassDiscoverySensor(String(myConfig.name), sHum),                true, MQTT_QOS);    // make HA discover the humidity sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sIP),                 myMqttHelper.buildHassDiscoverySensor(String(myConfig.name), sIP),                 true, MQTT_QOS);    // make HA discover the IP sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sCalibF),             myMqttHelper.buildHassDiscoverySensor(String(myConfig.name), sCalibF),             true, MQTT_QOS);    // make HA discover the scaling sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sCalibO),             myMqttHelper.buildHassDiscoverySensor(String(myConfig.name), sCalibO),             true, MQTT_QOS);    // make HA discover the offset sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sHysteresis),         myMqttHelper.buildHassDiscoverySensor(String(myConfig.name), sHysteresis),         true, MQTT_QOS);    // make HA discover the hysteresis sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sFW),                 myMqttHelper.buildHassDiscoverySensor(String(myConfig.name), sFW),                 true, MQTT_QOS);    // make HA discover the firmware version sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySwitch(swRestart),           myMqttHelper.buildHassDiscoverySwitch(String(myConfig.name), swRestart),           true, MQTT_QOS);    // make HA discover the reset switch
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySwitch(swUpdate),            myMqttHelper.buildHassDiscoverySwitch(String(myConfig.name), swUpdate),            true, MQTT_QOS);    // make HA discover the update switch
  #else
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoveryClimate().c_str(),                   myMqttHelper.buildHassDiscoveryClimate(String(myConfig.name).c_str(), String(FW)).c_str(),         true);    // make HA discover the climate component
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoveryBinarySensor(bsSensFail).c_str(),    myMqttHelper.buildHassDiscoveryBinarySensor(String(myConfig.name).c_str(), bsSensFail).c_str(),    true);    // make HA discover the binary_sensor for sensor failure
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoveryBinarySensor(bsState).c_str(),       myMqttHelper.buildHassDiscoveryBinarySensor(String(myConfig.name).c_str(), bsState).c_str(),       true);    // make HA discover the binary_sensor for thermostat state
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sTemp).c_str(),               myMqttHelper.buildHassDiscoverySensor(String(myConfig.name).c_str(), sTemp).c_str(),               true);    // make HA discover the temperature sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sHum).c_str(),                myMqttHelper.buildHassDiscoverySensor(String(myConfig.name).c_str(), sHum).c_str(),                true);    // make HA discover the humidity sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sIP).c_str(),                 myMqttHelper.buildHassDiscoverySensor(String(myConfig.name).c_str(), sIP).c_str(),                 true);    // make HA discover the IP sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sCalibF).c_str(),             myMqttHelper.buildHassDiscoverySensor(String(myConfig.name).c_str(), sCalibF).c_str(),             true);    // make HA discover the scaling sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sCalibO).c_str(),             myMqttHelper.buildHassDiscoverySensor(String(myConfig.name).c_str(), sCalibO).c_str(),             true);    // make HA discover the offset sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sHysteresis).c_str(),         myMqttHelper.buildHassDiscoverySensor(String(myConfig.name).c_str(), sHysteresis).c_str(),         true);    // make HA discover the hysteresis sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sFW).c_str(),                 myMqttHelper.buildHassDiscoverySensor(String(myConfig.name).c_str(), sFW).c_str(),                 true);    // make HA discover the firmware version sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySwitch(swRestart).c_str(),           myMqttHelper.buildHassDiscoverySwitch(String(myConfig.name).c_str(), swRestart).c_str(),           true);    // make HA discover the reset switch
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySwitch(swUpdate).c_str(),            myMqttHelper.buildHassDiscoverySwitch(String(myConfig.name).c_str(), swUpdate).c_str(),            true);    // make HA discover the update switch
  #endif
}

/* publish state topic in JSON format */
void mqttPubState(void) {
  String payload = myMqttHelper.buildStateJSON( /* build JSON payload */\
      String(myConfig.name), \
      String(intToFloat(myThermostat.getFilteredTemperature()), 1), \
      String(intToFloat(myThermostat.getFilteredHumidity()), 1), \
      String(intToFloat(myThermostat.getThermostatHysteresis()), 1), \
      String(boolToStringOnOff(myThermostat.getActualState())), \
      String(intToFloat(myThermostat.getTargetTemperature()), 1), \
      String(myThermostat.getSensorError()), \
      String(boolToStringHeatOff(myThermostat.getThermostatMode())), \
      String(myThermostat.getSensorCalibFactor()), \
      String(intToFloat(myThermostat.getSensorCalibOffset()), 0), \
      WiFi.localIP().toString(), \
      String(FW) );
  #if CFG_MQTT_LIB == cArduinoMQTT
  myMqttClient.publish( \
    myMqttHelper.getTopicData(), /* get topic */ \
    payload, \
    true, /* retain */ \
    MQTT_QOS); /* QoS */
  #else
  myMqttClient.publish( \
    myMqttHelper.getTopicData().c_str(), /* get topic */ \
    payload.c_str(), \
    true); /* retain */
  #endif
}

void handleWebServerClient(void) {
  String IPaddress = WiFi.localIP().toString();
  String webpage = "<!DOCTYPE html> <html>\n";
  webpage +="<head><meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0, user-scalable=no\">\n";
  webpage +="<title> "+ String(myConfig.name) + "</title>\n";
  webpage +="<style>html { font-family: Helvetica; display: inline-block; margin: 0px auto; text-align: left;}\n";
  webpage +="body{margin-top: 50px;} h1 {color: #444444;margin: 50px auto 30px;} h3 {color: #444444;margin-bottom: 50px;}\n";
  webpage +=".button {display: block;width: 80px;background-color: #1abc9c;border: none;color: white;padding: 13px 30px;text-decoration: none;font-size: 25px;margin: 0px auto 35px;cursor: pointer;border-radius: 4px;}\n";
  webpage +=".button-on {background-color: #1abc9c;}\n";
  webpage +=".button-on:active {background-color: #16a085;}\n";
  webpage +=".button-off {background-color: #34495e;}\n";
  webpage +=".button-off:active {background-color: #2c3e50;}\n";
  webpage +="p {font-size: 14px;color: #888;margin-bottom: 10px;}\n";
  webpage +="</style>\n";
  webpage +="</head>\n";
  webpage +="<body>\n";
  webpage +="<p><b>System information</b></p>";
  webpage +="<table>";
  webpage +="<tr><td>Name:</td><td>" + String(myConfig.name) + "</td></tr>";
  webpage +="<tr><td>Chip ID:</td><td>" + String(ESP.getChipId(), HEX) + "</td></tr>";
  webpage +="<tr><td>IP:</td><td>"+ IPaddress + "</td></tr>";
  webpage +="<tr><td>FW version:</td><td>"+ String(FW) + "</td></tr>";
  webpage +="<tr><td>Arduino Core:</td><td>"+ ESP.getCoreVersion() + "</td></tr>";
  webpage +="<tr><td>Reset Reason:</td><td>"+ ESP.getResetReason() + "</td></tr>";
  webpage +="<tr><td>Time since Reset:</td><td>"+ String(millisFormatted()) + "</td></tr>";
  webpage +="<tr><td>Flash Size:</td><td>"+ String(ESP.getFlashChipRealSize()) + "</td></tr>";
  webpage +="<tr><td>Sketch Size:</td><td>"+ String(ESP.getSketchSize()) + "</td></tr>";
  webpage +="<tr><td>Free for Sketch:</td><td>"+ String(ESP.getFreeSketchSpace()) + "</td></tr>";
  webpage +="<tr><td>Free Heap:</td><td>"+ String(ESP.getFreeHeap()) + "</td></tr>";
  webpage +="<tr><td>Vcc:</td><td>"+ String(ESP.getVcc()/1000.0) + "</td></tr>";
  webpage +="<tr><td>WiFi Status:</td><td>" + wifiStatusToString(WiFi.status()) + "</td></tr>";
  webpage +="<tr><td>WiFi RSSI:</td><td>" + String(WiFi.RSSI()) + "</td></tr>";
  webpage +="<tr><td>WiFi connects:</td><td>" + String(WiFiConnectCounter) + "</td></tr>";
  webpage +="<tr><td>MQTT connection:</td><td>" + String((myMqttClient.connected()) == true ? "connected" : "disconnected") + "</td></tr>";
  webpage +="<tr><td>MQTT connects:</td><td>" + String(MQTTConnectCounter) + "</td></tr>";
  webpage +="</table>";
  webpage +="<p><b>Change Name</b></p>";
  webpage +="<form action='http://"+IPaddress+"' method='POST'>";
  webpage +="<input type='text' name='newName'>&nbsp;<input type='submit' value='Submit'>";
  webpage +="</form>";
  webpage +="</body>\n";
  webpage +="</html>\n";

  webServer.send(200, "text/html", webpage);  /* Send a response to the client asking for input */

  if (webServer.args() > 0) {  /* Arguments were received */
    for ( uint8_t i = 0; i < webServer.args(); i++ ) {
      #ifdef CFG_DEBUG
      Serial.println("Argument reveived from Webpage: " + webServer.argName(i));  /* Display each argument */
      #endif /* CFG_DEBUG */

      if (webServer.argName(i) == "newName") {  /* heck for dedicated arguments */
        #ifdef CFG_DEBUG
        Serial.println("New name received via Webpage: " + webServer.arg(i));
        #endif /* CFG_DEBUG */
        if (webServer.arg(i) != myConfig.name) {  /* change name if it differs from the current one */
          #ifdef CFG_DEBUG
          Serial.println("Old name was: " + String(myConfig.name));
          #endif
          strlcpy(myConfig.name, webServer.arg(i).c_str(), sizeof(myConfig.name));
          nameChanged = true;
        }
      }
    }
  }
}

/* MQTT callback if a message was received */
#if CFG_MQTT_LIB == cArduinoMQTT
void messageReceived(String &topic, String &payload) { //NOLINT
#else
void messageReceived(char* c_topic, byte* data, unsigned int data_len) {
  char dataBuf[data_len+1];  // NOLINT: no need to allocate more buffer than necessary
  memcpy(dataBuf, data, data_len);
  dataBuf[sizeof(dataBuf)-1] = 0;
  String payload = String(dataBuf);
  String topic = String(c_topic);
#endif

  #ifdef CFG_DEBUG
  Serial.println("received: " + topic + " : " + payload);
  #endif

